// هنا تصدير للمكتبة اكسبرس نفس الي كنا نسويه مع الفنكشنس
// الي بين القوسين فقط تكتب اسم المكتبة بعكس الي كنا نسويه نضيف الباث للملف الي يحتوي على النفكشن
const express = require('express')


// هنا بناخذ نسخة من هذي المكتبة
// لمن نعمل تنفيذ بيرجع نسخة وهو بيكون السيرفر الخاص بنا
const app = express()
 
// دالة الجيت بنتعلم عنها اكثر قدام
// عبارة عن ميثود الباراميتر الأول شغلة إذا تم طلبها بطريقة او بآخرى قم بتنفيذ الباراميتر الثاني الي هو الفنكشن كول باك بداخلها اثنين باراميتر الريسبونس والريكويست بكل خصائصهم , يهمنا حالياً إيش نبغا من الريسبونس بداخل البودي
// اي احد يقوم بطلب الباث الي هو تيست
app.get('/test',(req, res)=>{
    // localhost:PORT/endpoint
    // localhost:3000/test  نضع هذا الرابط بالمتصفح
    res.send('GET Request and this is the response')
})

// جرب جيت ميثود ثانية على نفس البورت شوف ايش يصير معاك
app.get('/week5',(req, res)=>{
    res.send('Welcome to Week 5')
})

// النتيجة اعطاني ايرور
// الي فهمته ما ينفع لازم واحد راوت يا تيست يا وييك خمسة


// تحديث اليوم الي بعده جربت ومشي الحال الحمد لله . طلعت المشكلة انه ماحدث كان المفروض اقفل السيرفر وافتحه مرة ثانية المهم انه شغال الأن وماعندك مشكلة تضيف اي راوت وبيعرضلك الصفحة


// ميثود الليسن بتشغل السيرفر على البورت الموجود بين القوسين
//app.listen(3000)

// طريقة ثانية للكتابة مع الفنكشن كول باك
app.listen(3000, () => {
    console.log('Server is working ...')
})

// these code act as real server